Repository: BurdaMagazinOrg/module-access_unpublished
Catalog: translations/access_unpublished.*.po
Languages: es, nl

source: Access unpublished creates a hash value for unpublished nodes, to enable users the view the node, even if they do not have the correct privileges. After setting the correct permissions this module provides a direct access URL for unpublished content. Using the provided URL this content can be viewed by any role (including anonymous user) if this is specified in the !permissions of your site.
es: Access unpublished crea un valor hash para permitir a usuarios anónimos ver páginas no publicadas, aunque no tengan los privilegios necesarios. Después de configurar el módulo, proporciona una URL que accede directamente al contenido no publicado. Usando dicha URL, cualquier rol puede ver el contenido (incluidos usuarios anónimos) siempre que se especifique en los !permissions del sitio web.
nl: Access unpublished maakt een URL met hash waarde voor niet gepubliseerde nodes, zodat bezoekers de node toch kunnen bekijken, mits de !permissions goed zijn ingestelt

source: permissions
es: permissos
nl: privileges

source: The URL containing the hash value is generated using the node id combined with the private key you specify here. This URL is displayed after saving the node and when the author views the node.
es: La URL con el hash se crea a partir de la combinación del id del nodo y la clave privada que se espeficique aquí. La URL se muestra tras guardar el nodo, al verlo su autor.
nl: De URL met de hash waarde wordt gegenereerd met behulp van de sleutelwaarde die hier is gespecificeerd. De URL wordt getoont nadat een auteur een node opslaat.

source: NOTE: Changing the private key will render URL's that were generated with the old private key useless.
es: NOTA: Cambiar la clave privada invalida todas las URL generadas con la antigua clave privada.
nl: LET OP: Veranderen van de sleutelwaarde maakt alle eerder gegenereerde URL's onbruikbaar.

source: URL to access this unpublished node: <a href="@unpublished_url">@unpublished_url</a>
es: URL para compartir esta página: <a href="@unpublished_url">@unpublished_url</a>
nl: URL om deze node te bekijken: <a href="@unpublished_url">@unpublished_url</a>

source: Private key
es: Clave privada
nl: Sleutelwaarde

source: The private key is used for creating the hash value, which can be used to allow access to unpublished nodes.
es: La clave privada se utiliza para crear un valor hash, el cual se usa para permitir el acceso a nodos sin publicar.
nl: De sleutelwaarde die gebruikt wordt om de hash waarde te berekenen, welke toegang tot de niet gepubliseerde node mogelijk maakt.

source: Configure settings used to access unpublished content.
es: Configurar las opciones para acceder a contenido sin publicar.
nl: Configureer instellingen voor toegang tot niet gepubliseerde nodes

source: Generating private key
es: Generar clave privada
nl: Creeer sleutelwaarde

source: Removing private key: @key
es: Quitar clave privada: @key
nl: Verwijderen sleutelwaarde: @key

source: Module to give access to unpublished nodes, using a hash to identify users that should be able to view the node.
es: Module para permitir el acceso a nodos sin publicar, usando una clave hash para identificar a los usuarios que pueden ver el nodo.
nl: Module om toegang tot niet geubliseerde nodes te realiseren door gebruik te maken van een hash waarde waarmee een bezoeker zich toegang kan verschaffen tot de node.
